AcGiRapidRTRenderSettingsTraits.filterHeight
Get the current filter height
Returns: Current filter height

AcGiRapidRTRenderSettingsTraits.setFilterHeight(System.Single)
Sets the filter height. 1.0 means one pixel (image sample).
Recommended default sizes: box = 1.0, triangle = 2.0, Gaussian = 3.0, Lanczos = 4.0, Mitchell = 4.0
height: Filter height to be set.
Returns: void

AcGiRapidRTRenderSettingsTraits.filterWidth
Get the current filter width.
Returns: Return the current filter width.

AcGiRapidRTRenderSettingsTraits.setFilterWidth(System.Single)
Sets the filter width. 1.0 means one pixel (image sample).
Recommended default sizes: box = 1.0, triangle = 2.0, Gaussian = 3.0, Lanczos = 4.0, Mitchell = 4.0
width: Filter width to be set.
Returns: void

AcGiRapidRTRenderSettingsTraits.filterType
Get the current filter type.
Returns: Return the current filter type.

AcGiRapidRTRenderSettingsTraits.setFilterType(AcGiFilterType)
Set the filter type applied to the image samples when super sampling. Different filter type favors different filter width / height.
filterInfo: Filter type to be set.
Returns: void

AcGiRapidRTRenderSettingsTraits.lightingMode
Get the lighting mode being set.
Returns: Return the lighting mode being set.

AcGiRapidRTRenderSettingsTraits.setLightingMode(AcGiLightingMode)
Turn on basic lighting or advanced lighting according the lighting mode set.
Basic lighting uses ambient occlusion and a simpler model for ambient light and IBL.
Advanced lighting uses full global illumination and a more advanced model for ambient light and IBL.
mode: Desired lighting mode to be set.
Returns: void

AcGiRapidRTRenderSettingsTraits.desiredRenderLevel
Get the desired render level.
Returns: Return the desired render level.

AcGiRapidRTRenderSettingsTraits.setDesiredRenderLevel(System.Int32)
If choosing to use the option of render level to control render quality, we can use this function to set the desired rendering level.
renderLevel: Desired render level to be set. The range is from 1 to 50.
Returns: void

AcGiRapidRTRenderSettingsTraits.desiredRenderTime
Get the desired render time.
Returns: Return the desired render time.

AcGiRapidRTRenderSettingsTraits.setDesiredRenderTime(System.Int32)
If choosing to use the option of render time to control render quality, we can use this function to set the desired rendering time.
renderTime: Desired render time to be set, which is by second. The range is from 1 minute to 1440 minutes.
Returns: void

AcGiRapidRTRenderSettingsTraits.quitCondition
Get the quit condition
Returns: Return the quit condition

AcGiRapidRTRenderSettingsTraits
Abstract interface class that controls all the rendering settings.